Repository: A-Randomm-User/calculator
Catalog: calculator/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant, zh_hk

source: 2 Distinct Roots
zh_hans: 不等实数根
zh_hant: 兩相異實根
zh_hk: 2個相異根

source: 2 Equal Roots
zh_hans: 相等实数根
zh_hant: 兩相同實根
zh_hk: 2個相等根

source: About This Build
zh_hans: 关于此版本
zh_hant: 關於此版本
zh_hk: 關於此版本

source: Acre (ac)
zh_hans: 英亩（ac）
zh_hant: 英畝（ac）
zh_hk: 英畝（ac）

source: Acre Foot (ac·ft)
zh_hans: 英亩英尺（ac·ft）
zh_hant: 英畝英尺（ac·ft）
zh_hk: 英畝英尺（ac·ft）

source: American Football Field
zh_hans: 美式足球场
zh_hant: 美式足球場
zh_hk: 美式足球場

source: angle c
zh_hans: 角c
zh_hant: 角c
zh_hk: 角c

source: Append
zh_hans: 添加
zh_hant: 加入
zh_hk: 添加

source: Are (a)
zh_hans: 公亩（a）
zh_hant: 公畝（a）
zh_hk: 公畝（a）

source: Area
zh_hans: 面积
zh_hant: 面积
zh_hk: 面積

source: Area Conversion
zh_hans: 面积转换
zh_hant: 面積換算
zh_hk: 面積換算

source: Association Football Field
zh_hans: 足球场
zh_hant: 足球場
zh_hk: 足球場

source: Astronomical Unit (AU)
zh_hans: 天文单位（AU）
zh_hant: 天文單位（AU）
zh_hk: 天文單位（AU）

source: Barrel (bbl)
zh_hans: 桶（bbl）
zh_hant: 桶（bbl）
zh_hk: 桶（bbl）

source: Base
zh_hans: 底
zh_hant: 底邊
zh_hk: 底邊

source: Binary
zh_hans: 二进制
zh_hant: 二進位
zh_hk: 進制2

source: Binary:
zh_hans: 进制2
zh_hant: 二進位
zh_hk: 二進制：

source: Board Foot (bd ft)
zh_hans: 板英尺（bd ft）
zh_hant: 板呎（bd ft）
zh_hk: 板呎（bd ft）

source: Bottom base length
zh_hans: 下底
zh_hant: 下底邊長
zh_hk: 下底邊長

source: Calculator
zh_hans: 计算器
zh_hant: 計算器
zh_hk: 計算機

source: Cancel
zh_hans: 取消
zh_hant: 取消操作
zh_hk: 取消

source: Cannot take the square root of a negative number
zh_hans: 负数无法被根号
zh_hant: 負數無法被根號
zh_hk: 不能對複數開平方根

source: Centiliter (cL)
zh_hans: 厘升（cL）
zh_hant: 釐昇（cL）
zh_hk: 釐昇（cL）

source: Centimeter (cm)
zh_hans: 厘米（cm）
zh_hant: 公分（cm）
zh_hk: 釐米（cm）

source: Central Tendency
zh_hans: 集中趋势
zh_hant: 集中趨勢
zh_hk: 集中趨勢

source: circle
zh_hans: 圆形
zh_hant: 圓形
zh_hk: 圓形

source: Clear
zh_hans: 清除
zh_hant: 清除
zh_hk: 清除

source: Clear all values?
zh_hans: 清除所有内容
zh_hant: 是否清除所有值？
zh_hk: 清除所有數值？

source: Coefficient a
zh_hans: 系数A
zh_hant: 係數A
zh_hk: 係數a

source: Coefficient b
zh_hans: 系数B
zh_hant: 係數B
zh_hk: 係數b

source: Coefficient c
zh_hans: 系数C
zh_hant: 係數C
zh_hk: 係數c

source: Complex Math
zh_hans: 复数数学
zh_hant: 複數數學
zh_hk: 複數數學

source: Compound Interest
zh_hans: 复利
zh_hant: 複利
zh_hk: 複利

source: Conversion
zh_hans: 转换
zh_hant: 換算
zh_hk: 換算

source: Convert
zh_hans: 转换
zh_hant: 換算
zh_hk: 換算

source: Convert area
zh_hans: 转换面积
zh_hant: 換算面積
zh_hk: 換算面積

source: Convert length
zh_hans: 转换长度
zh_hant: 換算長度
zh_hk: 換算長度

source: Convert Number
zh_hans: 转换进制
zh_hant: 轉換數字
zh_hk: 換算數字

source: Convert Number System
zh_hans: 转换进制
zh_hant: 轉換進位
zh_hk: 換算進制

source: Convert volume
zh_hans: 转换体积
zh_hant: 換算體積
zh_hk: 換算提及

source: Create Pie Chart
zh_hans: 创建饼图
zh_hant: 創建圓餅圖
zh_hk: 建立圓餅圖

source: Created by Aaron
zh_hans: 由Aaron制作
zh_hant: 由Aaron創作
zh_hk: 由Aaron製作

source: cubic
zh_hans: 立方（数列）
zh_hant: 立方（數列）
zh_hk: 立方（數列）

source: Cubic Centimeter (cm³)
zh_hans: 立方厘米（cm³)
zh_hant: 立方公分（cm³)
zh_hk: 立方釐米（cm³)

source: Cubic Decimeter (dm³)
zh_hans: 立方分米（dm³)
zh_hant: 立方公寸（dm³)
zh_hk: 立方分米（dm³)

source: Cubic Foot (ft³)
zh_hans: 立方英尺（ft³)
zh_hant: 立方呎（ft³)
zh_hk: 立方呎（ft³)

source: Cubic Inch (in³)
zh_hans: 立方英寸（in³)
zh_hant: 立方吋（in³)
zh_hk: 立方吋（in³)

source: Cubic Kilometer (km³)
zh_hans: 立方千米（km³)
zh_hant: 立方公里（km³)
zh_hk: 立方公里（km³)

source: Cubic Meter (m³)
zh_hans: 立方米（m³)
zh_hant: 立方公尺（m³)
zh_hk: 立方米（m³)

source: Cubic mile (mi³)
zh_hans: 立方英里（mi³)
zh_hant: 立方英里（mi³)
zh_hk: 立方英里（mi³)

source: Cubic Millimeter (mm³)
zh_hans: 立方毫米（mm³)
zh_hant: 立方公釐（mm³)
zh_hk: 立方毫米（mm³)

source: Cubic yard (yd³)
zh_hans: 立方码（yd³)
zh_hant: 立方碼（yd³)
zh_hk: 立方碼（yd³)

source: Cup (cup)
zh_hans: 杯（cup）
zh_hant: 杯（cup）
zh_hk: 杯

source: Decaliter (daL)
zh_hans: 十升（daL）
zh_hant: 十公升（daL）
zh_hk: 十升（daL）

source: Decameter (dam)
zh_hans: 十米（dam）
zh_hant: 十公尺（dam）
zh_hk: 十米（dam）

source: Decare (daa)
zh_hans: 十公亩（daa）
zh_hant: 十公畝（daa）
zh_hk: 十公畝（daa）

source: Deciliter (dL)
zh_hans: 分升（dL）
zh_hant: 分公升（dL）
zh_hk: 分升（dL）

source: Decimal
zh_hans: 十进制
zh_hant: 十進位
zh_hk: 進制10

source: Decimal:
zh_hans: 进制10
zh_hant: 十進位
zh_hk: 十進制：

source: Decimeter (dm)
zh_hans: 分米（dm）
zh_hant: 公寸（dm）
zh_hk: 十米

source: Delete
zh_hans: 删除
zh_hant: 刪除
zh_hk: 刪除

source: diagonal 1
zh_hans: 对角线1
zh_hant: 對角線1
zh_hk: 對角線1

source: diagonal 2
zh_hans: 对角线2
zh_hant: 對角線2
zh_hk: 對角線2

source: Discriminant
zh_hans: 判断式
zh_hant: 判別式
zh_hk: 判別式

source: Enter a value
zh_hans: 输入数值
zh_hant: 輸入數值
zh_hk: 輸入數值

source: Enter for a₁
zh_hans: 输入a₁
zh_hant: 鍵入a₁
zh_hk: 輸入a₁

source: Enter for a₂
zh_hans: 输入a₂
zh_hant: 鍵入a₂
zh_hk: 輸入a₂

source: Enter for b₁
zh_hans: 输入b₁
zh_hant: 鍵入b₁
zh_hk: 輸入b₁

source: Enter for b₂
zh_hans: 输入b₂
zh_hant: 鍵入b₂
zh_hk: 輸入b₂

source: Enter for c₁
zh_hans: 输入c₁
zh_hant: 鍵入c₁
zh_hk: 輸入c₁

source: Enter for c₂
zh_hans: 输入c₂
zh_hant: 鍵入c₂
zh_hk: 輸入c₂

source: Enter input
zh_hans: 键入
zh_hant: 鍵入
zh_hk: 輸入資料

source: Enter value
zh_hans: 输入数值
zh_hant: 鍵入數值
zh_hk: 輸入數值

source: Exact Form: %@π
zh_hans: 精确值：%@π
zh_hant: 精確形式：%@π
zh_hk: 精確形式：%@π

source: Exponential Decay
zh_hans: 指数衰减
zh_hant: 指數衰減
zh_hk: 指數衰減

source: Exponential Increase
zh_hans: 指数增长
zh_hant: 指數增加
zh_hk: 指數增長

source: Fathom (fm)
zh_hans: 英寻（fm）
zh_hant: 英尋（fm）
zh_hk: 英尋（fm）

source: Final Amount
zh_hans: 最终金额
zh_hant: 最終金額
zh_hk: 最終金額

source: Find Area
zh_hans: 求面积
zh_hant: 求面積
zh_hk: 求面積

source: Find Area of 2D Shape
zh_hans: 求二维图形面积
zh_hant: 求二維圖形面積
zh_hk: 求二維圖形面積

source: Find Area of Shape
zh_hans: 找形状面积
zh_hant: 求圖形面積
zh_hk: 求圖形面積

source: Find nth term
zh_hans: 求通项公式
zh_hant: 找n項
zh_hk: 求第n項

source: Find nth Term
zh_hans: 求通项公式
zh_hant: 找n項
zh_hk: 求第n項

source: Find nth term in Sequence
zh_hans: 求通项公式
zh_hant: 求數列的第n項
zh_hk: 求第n項

source: Find unknown
zh_hans: 找未知
zh_hant: 找未知
zh_hk: 求未知

source: Fluid Dram (fl dr)
zh_hans: 液量打兰（fl dr）
zh_hant: 液量打蘭（fl dr）
zh_hk: 液量打蘭（fl dr）

source: Fluid Ounce (fl oz)
zh_hans: 液量盎司（fl oz）
zh_hant: 液量盎司（fl oz）
zh_hk: 液量盎司（fl oz）

source: Foot (ft)
zh_hans: 英尺（ft）
zh_hant: 呎（ft）
zh_hk: 呎（ft）

source: Gallon (gal)
zh_hans: 加仑（gal）
zh_hant: 加侖（gal）
zh_hk: 加侖（gal）

source: Get statitics
zh_hans: 取得统计数据
zh_hant: 取得統計資料
zh_hk: 取得統計資料

source: Gills (gi)
zh_hans: 合（gi）
zh_hant: 合（gi）
zh_hk: 合（gi）

source: Growth and Decay
zh_hans: 增长与衰减
zh_hant: 增長與衰減
zh_hk: 增長與衰減

source: Hectare (ha)
zh_hans: 公顷（ha）
zh_hant: 公頃（ha）
zh_hk: 公頃（ha）

source: Hectoliter (hL)
zh_hans: 百升（hL）
zh_hant: 百升（hL）
zh_hk: 百升（hL）

source: Hectometer (hm)
zh_hans: 百米（hm）
zh_hant: 百米（hm）
zh_hk: 百米（hm）

source: Height
zh_hans: 高
zh_hant: 高度
zh_hk: 高度

source: Hexadecimal
zh_hans: 十六进制
zh_hant: 十六進位
zh_hk: 十六進制

source: Hexadecimal:
zh_hans: 进制16
zh_hant: 十六進位
zh_hk: 十六進制：

source: Imperial
zh_hans: 英制
zh_hant: 英制
zh_hk: 英制

source: Inch (in)
zh_hans: 英寸（in）
zh_hant: 吋（in）
zh_hk: 吋（in）

source: Kilometer (km)
zh_hans: 公里（km）
zh_hant: 公里（km）
zh_hk: 公里（km）

source: kite
zh_hans: 风筝形
zh_hant: 風箏型
zh_hk: 風箏型

source: Leave it empty to make it as unknown
zh_hans: 留空来设为x
zh_hant: 留空以設為未知數
zh_hk: 留空以設為未知數

source: Length
zh_hans: 长
zh_hant: 長度
zh_hk: 長度

source: Length Conversion
zh_hans: 长度转换
zh_hant: 長度轉換
zh_hk: 長度換算

source: Light Year (ly)
zh_hans: 光年（ly）
zh_hant: 光年（ly）
zh_hk: 光年（ly）

source: linear
zh_hans: 线性
zh_hant: 線型
zh_hk: 線型（數列）

source: Liter (L)
zh_hans: 升（L）
zh_hant: 升（L）
zh_hk: 升（L）

source: Lunar Distance (ld)
zh_hans: 月球距离（ld）
zh_hant: 月球距離（ld）
zh_hk: 月球距離（ld）

source: Math
zh_hans: 数学
zh_hant: 算術
zh_hk: 數學

source: Mean
zh_hans: 均值
zh_hant: 平均數
zh_hk: 平均數

source: Measures of central tendency
zh_hans: 集中趋势的度量
zh_hant: 集中趨勢的度量
zh_hk: 集中趨勢的度量

source: Median
zh_hans: 中位数
zh_hant: 中位數
zh_hk: 中位數

source: Megameter (Mm)
zh_hans: 百万米（Mm）
zh_hant: 百萬公尺（Mm）
zh_hk: 百萬米（Mm）

source: Meter (m)
zh_hans: 米（m）
zh_hant: 公尺（m）
zh_hk: 米（m）

source: Metric
zh_hans: 公制
zh_hant: 公制
zh_hk: 公制

source: Metric Land
zh_hans: 公制土地单位
zh_hant: 公制土地單位
zh_hk: 公制土地單位

source: Microliter (μL)
zh_hans: 微升（μL）
zh_hant: 微升（μL）
zh_hk: 微升（μL）

source: Micrometer (µm)
zh_hans: 微米（µm）
zh_hant: 微米（µm）
zh_hk: 微米（μm）

source: Mile (mi)
zh_hans: 英里（mi）
zh_hant: 英里（mi）
zh_hk: 英里（mi）

source: Milliliter (mL)
zh_hans: 英里（mi）
zh_hant: 毫公升（mL）
zh_hk: 毫升（mL）

source: Millimeter (mm)
zh_hans: 毫米（mm）
zh_hant: 公釐（mm）
zh_hk: 毫米（mm）

source: Nanoliter (nL)
zh_hans: 纳升（nL）
zh_hant: 納升（nL）
zh_hk: 納升（nL）

source: Nanometer (nm)
zh_hans: 纳米（nm）
zh_hant: 奈米（nm）
zh_hk: 納米（nmi）

source: Nautical Mile (nmi)
zh_hans: 海里（nmi）
zh_hant: 海里（nmi）
zh_hk: 海里（nmi）

source: No Real Roots
zh_hans: 没有实数根
zh_hant: 無實數根
zh_hk: 沒有實根

source: No Solution
zh_hans: 无解
zh_hant: 無解
zh_hk: 無解

source: No values added
zh_hans: 尚未添加任何数值
zh_hant: 尚未加入任何數值
zh_hk: 尚未介入任何數值

source: None
zh_hans: 无
zh_hant: 無
zh_hk: 無

source: Not a quadratic
zh_hans: 不是一个二元一次方程
zh_hant: 不是一個二次方程式
zh_hk: 不是一個二次函數

source: nth Term
zh_hans: 第n项
zh_hant: 第n項
zh_hk: 第n項

source: Octal
zh_hans: 八进制
zh_hant: 八進位
zh_hk: 進制8

source: Octal:
zh_hans: 进制8
zh_hant: 八進位
zh_hk: 八進制：

source: Original Amount
zh_hans: 原数值
zh_hant: 本金
zh_hk: 原始數值

source: Other Land
zh_hans: 其他土地单位
zh_hant: 其他土地單位
zh_hk: 其他土地單位

source: Others
zh_hans: 其他
zh_hant: 其他
zh_hk: 其他

source: Output
zh_hans: 输出
zh_hant: 輸出
zh_hk: 輸出

source: parallelogram
zh_hans: 平行四边形
zh_hant: 平行四邊形
zh_hk: 平行四邊形

source: Parsec (pc)
zh_hans: 秒差距（pc）
zh_hant: 秒差距（pc）
zh_hk: 秒差距（pc）

source: Perpendicular Height
zh_hans: 垂直高度
zh_hant: 垂直高度
zh_hk: 垂直高度

source: Picometer (pm)
zh_hans: 皮米（pm）
zh_hant: 皮米（pm）
zh_hk: 皮米（pm）

source: Pie Chart
zh_hans: 饼图
zh_hant: 圓餅圖
zh_hk: 圓餅圖

source: Pint (pt)
zh_hans: 品脱（pt）
zh_hant: 品脫（pt）
zh_hk: 品脫（pt）

source: quadratic
zh_hans: 平方
zh_hant: 二次方程式
zh_hk: 平方

source: Quadratic
zh_hans: 二次函数
zh_hant: 二次方程式
zh_hk: 二次函數

source: Quart (qt)
zh_hans: 夸脱（qt）
zh_hant: 誇脫（qt）
zh_hk: 誇脫（qt）

source: Radius
zh_hans: 半径
zh_hant: 半徑
zh_hk: 半徑

source: Range
zh_hans: 范围
zh_hant: 全距
zh_hk: 全距

source: Rate
zh_hans: 利息率
zh_hant: 率
zh_hk: 利率

source: rectangle
zh_hans: 正方形
zh_hant: 長方形
zh_hk: 長方形

source: Released in: 2026.07.23
zh_hans: 发布时间：26年7月23日
zh_hant: 發布時間：26年7月23日
zh_hk: 發布時間：2026年7月23日

source: Released in: 2026.07.24
zh_hans: 发布时间：26年7月24日
zh_hant: 發布時間：26年7月24日
zh_hk: 發布時間：2026年7月24日

source: Released in: 2026.07.26
zh_hans: 发布时间：26年7月26日
zh_hant: 發布時間：26年7月26日
zh_hk: 發布時間：2026年7月26日

source: Released in: 2026.07.27
zh_hans: 发布时间：26年7月27日
zh_hant: 發布時間：26年7月27日
zh_hk: 發布時間：2026年7月27日

source: Released in: 2026.07.29
zh_hans: 发布时间：26年7月29日
zh_hant: 發布時間：26年7月29日
zh_hk: 發布時間：2026年7月29日

source: Released in: 2026.07.30
zh_hans: 发布时间：26年7月30日
zh_hant: 發布時間：26年7月30日
zh_hk: 發布時間：2026年7月30日

source: Released in: 2026.08.02
zh_hans: 发布时间：26年8月2日
zh_hant: 發布時間：26年8月2日
zh_hk: 發布時間：2026年8月2日

source: Released in: 2026.08.03
zh_hans: 发布时间：26年8月3日
zh_hant: 發布時間：26年8月3日
zh_hk: 發布時間：2026年8月3日

source: Released in: 2026.08.07
zh_hans: 发布时间：26年8月7日
zh_hant: 發布時間：26年8月7日
zh_hk: 發布時間：2026年8月7日

source: rhombus
zh_hans: 菱形
zh_hant: 菱形
zh_hk: 菱形

source: Roots
zh_hans: 根
zh_hant: 根
zh_hk: 根

source: Rounded Value: %@
zh_hans: 近似值：%@
zh_hant: 約值：%@
zh_hk: 約值：%@

source: Select a calculator
zh_hans: 选择侧栏任意选项
zh_hant: 側欄選擇一個選項
zh_hk: 選擇一個模式以繼續

source: Select Shape
zh_hans: 选择形状
zh_hant: 選擇形狀
zh_hk: 選擇形狀

source: Select System
zh_hans: 选择进制
zh_hant: 選擇系統
zh_hk: 選擇進制

source: Sequence Type
zh_hans: 数列类型
zh_hant: 數列格式
zh_hk: 數列類型

source: Simple Interest
zh_hans: 单利
zh_hant: 單例
zh_hk: 單利

source: Solution
zh_hans: 答案
zh_hant: 答案
zh_hk: 答案

source: Solve
zh_hans: 解
zh_hant: 解題
zh_hk: 解

source: Solve 2 unknown Linear Simultaneous Equation
zh_hans: 解二元一次方程组
zh_hant: 解二元一次聯立方程式
zh_hk: 求解二元一次聯立方程

source: Solve 2 unknowns of Linear Simultaneous Equation
zh_hans: 解二元一次方程组
zh_hant: 解二元一次聯立方程式
zh_hk: 求解二元一次聯立方程

source: Solve Quadratic Equation
zh_hans: 解二元次方程
zh_hant: 解二次方程式
zh_hk: 求解二次方程

source: Sports
zh_hans: 运动
zh_hant: 運動
zh_hk: 運動

source: square
zh_hans: 正方形
zh_hant: 正方形
zh_hk: 正方形

source: Square Centimeter (cm²)
zh_hans: 平方厘米（cm²）
zh_hant: 平方公分（cm²）
zh_hk: 平方釐米（cm²)

source: Square Decimeter (dm²)
zh_hans: 平方分米（dm²）
zh_hant: 平方公寸（dm²）
zh_hk: 平方分米（dm²)

source: Square Foot (ft²)
zh_hans: 平方英尺（ft²）
zh_hant: 平方呎（ft²）
zh_hk: 平方呎（ft²)

source: Square Inch (in²)
zh_hans: 平方英寸（in²）
zh_hant: 平方吋（in²）
zh_hk: 平方吋（in²)

source: Square Kilometer (km²)
zh_hans: 平方公里（km²）
zh_hant: 平方公里（km²）
zh_hk: 平方公里（km²)

source: Square Meter (m²)
zh_hans: 平方米（m²）
zh_hant: 平方公尺（m²）
zh_hk: 平方米（m²)

source: Square Mile (mi²)
zh_hans: 平方英里（mi²）
zh_hant: 平方英里（mi²）
zh_hk: 平方英里（mi²)

source: Square Millimeter (mm²)
zh_hans: 平方毫米（mm²）
zh_hant: 平方公釐（mm²）
zh_hk: 平方毫米（mm²)

source: Square Yard (yd²)
zh_hans: 平方码（yd²）
zh_hant: 平方碼（yd²）
zh_hk: 平方碼（yd²)

source: Stremma (str)
zh_hans: 希腊亩（str）
zh_hant: 希臘畝（str）
zh_hk: 希臘畝（str）

source: Tablespoon (tbsp)
zh_hans: 汤匙（tbsp）
zh_hant: 湯匙（tbsp）
zh_hk: 湯匙

source: Teaspoon (tsp)
zh_hans: 茶匙（tsp）
zh_hant: 茶匙（tsp）
zh_hk: 茶匙

source: There should be only 1 unknown
zh_hans: 只能拥有一个x
zh_hant: 只能有一個未知數
zh_hk: 只可有一個未知數

source: Turning Point
zh_hans: 转折点
zh_hant: 轉折點
zh_hk: 轉折點

source: Unit (1)
zh_hans: 单位(1)
zh_hant: 單位(1)
zh_hk: 單位（1）

# Unit (1): %@ Unit (2): %@
source: Unit (1): %1$@ Unit (2): %2$@
zh_hans: 单位(1)：%1$@ 单位(2)：%2$@
zh_hant: 單位(1): %1$@ 單位(2): %2$@
zh_hk: 單位（1）: %1$@ Unit（2）: %2$@

source: Unit (2)
zh_hans: 单位(2)
zh_hant: 單位(2)
zh_hk: 單位（2）

source: unknown
zh_hans: 未知
zh_hant: 未知
zh_hk: 未知

source: Value < 0
zh_hans: 数值<0
zh_hant: 值 < 0
zh_hk: 值 < 0

source: Value = 0
zh_hans: 数值=0
zh_hant: 值 = 0
zh_hk: 值 = 0

source: Value > 0
zh_hans: 数值>0
zh_hant: 值 > 0
zh_hk: 值 > 0

# Version %@, Build %@
source: Version %1$@, Build %2$@
zh_hans: 版本%1$@，内部版本%2$@
zh_hant: 版本%1$@，版號%2$@
zh_hk: 版本 %1$@，版本編號 %2$@

source: Version 1.0, Build 7
zh_hans: 版本1.0，内部版本7
zh_hant: 版本1.0，版號7
zh_hk: 版本 1.0，版本編號 7

source: Version 1.0, Build 8
zh_hans: 版本1.0，内部版本8
zh_hant: 版本1.0，版號8
zh_hk: 版本 1.0，版本編號 8

source: Version 1.0, Build 9
zh_hans: 版本1.0，内部版本9
zh_hant: 版本1.0，版號9
zh_hk: 版本 1.0，版本編號 9

source: Version 1.0, Build 10
zh_hans: 版本1.0，内部版本10
zh_hant: 版本1.0，版號10
zh_hk: 版本 1.0，版本編號 10

source: Version 1.0, Build 11
zh_hans: 版本1.0，内部版本11
zh_hant: 版本1.0，版號11
zh_hk: 版本 1.0，版本編號 11

source: Version 1.0, Build 12
zh_hans: 版本1.0，内部版本12
zh_hant: 版本1.0，版號12
zh_hk: 版本 1.0，版本編號 12

source: Version 1.0, Build 13
zh_hans: 版本1.0，内部版本13
zh_hant: 版本1.0，版號13
zh_hk: 版本 1.0，版本編號 13

source: Version 1.0, Build 14
zh_hans: 版本1.0，内部版本14
zh_hant: 版本1.0，版號14
zh_hk: 版本 1.0，版本編號 14

source: Version 1.0, Build 15
zh_hans: 版本1.0，内部版本15
zh_hant: 版本1.0，版號15
zh_hk: 版本 1.0，版本編號 15

source: Version 1.0, Build 16
zh_hans: 版本1.0，内部版本16
zh_hant: 版本1.0，版號16
zh_hk: 版本 1.0，版本編號 16

source: Version 1.0, Build 17
zh_hans: 版本1.0，内部版本17
zh_hant: 版本1.0，版號17
zh_hk: 版本 1.0，版本編號 17

source: Waiting...
zh_hans: 等待中…
zh_hant: 等待中…
zh_hk: 等待中

source: Working out the Turning Point
zh_hans: 正在解转折点
zh_hant: 正在解轉折點
zh_hk: 正在解轉折點

source: Yard (yd)
zh_hans: 码（yd）
zh_hant: 碼（yd）
zh_hk: 碼（yd）

source: Year
zh_hans: 年
zh_hant: 年
zh_hk: 年

source: Years
zh_hans: 年
zh_hant: 年
zh_hk: 年

source: Your current inputs and results will be cleared.
zh_hans: 你当前输入的所有内容将被清除
zh_hant: 你當前鍵入的內容將被清除
zh_hk: 你當前輸入的內容將被清理

source: This update added: 1. Animations on Quadratic 2. Sidebar on iPad and Mac
zh_hans: 本次更新新增： 1. 二次函数动画 2. 侧栏
zh_hant: 本次更新新增： 二次方程動畫 側欄

source: This update added: 1. Area calculations 2. Optimize code
zh_hans: 本次更新新增： 1. 面积计算 2. 优化代码

source: This update added: 1. Binary to Denary and inversely conversion 2. Adaptation to iOS 26 Liquid Glass
zh_hans: 本次更新新增： 1. 二进制与十进制及反向转换 2. 适配 iOS 26 Liquid Glass 界面
zh_hant: 本次更新新增： 二進位與十進位之間的雙向換算 適應 iOS 26 Liquid Glass 設計風格

source: This update added: 1. Binary to Denary and inversely conversion 2. Adaptation to iOS 26 Liquid Glass Known Issues: 1. Conversion does not convert negative numbers 2. Decimal point can be entered in Conversion and will return a wrong value
zh_hans: 本次更新新增： 1. 二进制与十进制及反向转换 2. 适配 iOS 26 Liquid Glass 已知问题： 1. 转换功能无法转换负数 2. 转换过程中可以输入小数点，但会返回错误值
zh_hant: 本次更新新增： 二進位與十進位之間的雙向換算適應 iOS 26 Liquid Glass 設計風格 已知問題： 換算功能目前不支援負數轉換 在換算模式中可以輸入小數點，但會返回錯誤的數值

source: This update added: 1. Conversion of Number systems 2. Better use on Liquid Glass 3. More localization
zh_hans: 本次更新新增： 1. 进制转换 2. 更佳的 Liquid Glass 使用体验 3. 更精准的翻译
zh_hant: 本次更新新增： 進位制換算 優化 Liquid Glass 的操作體驗 完善其他語言

source: This update added: 1. Finding 2 unknowns of Linear Simultaneous Equation 2. Length Conversion 3. Rounding up values on other modes 4. Distinguish modes in main menu 5. Improved entering values in in Sequence as keyboard users now can return to go to next TextField
zh_hans: 本次更新新增： 1. 求解二元一次方程组 2. 长度转换 3. 其他模式下数值向上取整 4. 主菜单中模式区分 5. 改进了按顺序输入数值的功能，键盘用户现在可以返回到下一个文本框
zh_hant: 本次更新新增： 解二元一次聯立方程式 長度單位換算 在其他模式進位數值以縮短 在主選單中區分不同模式 優化數列模式的數值輸入體驗

source: This update added: 1. Finding unknown from Simple or Compound interest 2. New Icon
zh_hans: 本次更新新增： 1. 计算单利或复利未知数 2. 新图标
zh_hant: 本次更新新增： 求單利或複利中的未知數 全新圖示

source: This update added: 1. More conversion 2. Added animations
zh_hans: 本次更新新增： 1. 更多转换 2. 添加动画
zh_hant: 本次更新新增： 更多換算模式 動畫

source: This update added: 1. More shapes available 2. Pie Chart 3. Renamed Interest to Model 4. Added more modes to Interest 5. Removed "?" and replace action with leaving empty 6. Volume Conversions 7. More units for Area and Length
zh_hans: 此更新新增： 1. 新增更多图形。 2. 新增饼图功能。 3. 将“Interest”重命名为“Model”。 4. 为“Interest”新增更多模式。 5. 移除“？”，改为留空表示未知数。 6. 新增体积换算。 7. 新增更多面积和长度单位。
zh_hant: 此更新新增： 新增更多圖形。 新增圓餅圖功能。 將「Interest」重新命名為「Model」。 為「Interest」新增更多模式。 移除「?」，改為留空表示未知數。 新增體積換算。 新增更多面積及長度單位。

source: This update added: 1. More units to length conversion 2. More localization
zh_hans: 本次更新新增： 1. 更多长度单位转换 2. 更多翻译
zh_hant: 本次更新新增： 支援更多長度換算單位 完善語言

source: This update added: 1. New Icon 2. Localization Fixed: 1. No Button for Simultaneous 2. Length should include displacement 3. TextField length unification for iOS 17 & 18 on Simultaneous
zh_hans: 本次更新新增： 1. 新图标 2. 本地化 修复： 1. 二元一次方程组的解题按钮缺失 2. 长度应包含矢量量 3. 统一 iOS 17 和 18 中“二元一次方程组”模式下的文本框长度
zh_hant: 本次更新新增： 全新圖示 多國語言支援 修正： 修正聯立方程式缺少按鈕的問題 修正長度換算未包含位移單位的問題 統一聯立方程式在 iOS 17 與 iOS 18 的文字輸入框長度

source: Top base length
zh_hans: 上底

source: trapezoid
zh_hans: 梯形

source: triangle (with included angle)
zh_hans: 三角形（已知夹角）
zh_hant: 三角形（已知夾角）

source: triangle (with perpendicular height)
zh_hans: 三角形（已知垂直高度）
zh_hant: 三角形（已知垂直高度）

source: UK
zh_hans: 英国英制
zh_hant: 英國英制

source: US
zh_hans: 美国英制
zh_hant: 美國英制

source: Value
zh_hans: 值
zh_hant: 值

source: Values entered
zh_hans: 已输入的值
zh_hant: 已輸入的值

source: Volume Conversion
zh_hans: 体积转换
zh_hant: 容量換算

source: Width
zh_hans: 宽
zh_hant: 寬

source: Working out the Discriminant
zh_hans: 正在解判别式
zh_hant: 正在解判別式

source: Working out the Solution
zh_hans: 正在解x
zh_hant: 正在解答案
